IDEA StatiCa Open Model
TypeDeflectionSheme Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Scheme
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeDeflectionSheme
Public Enumeration TypeDeflectionSheme
public enum class TypeDeflectionSheme
Members
Member name | Value | Description
DeflectionSheme_I | 0 |  constant moment - single span
DeflectionSheme_II | 1 |  one single force - single span
DeflectionSheme_III | 2 |  single moment at the begging or end of the span - single span
DeflectionSheme_IV | 3 |  two forces - single span
DeflectionSheme_V | 4 |  linear distributed loads - single span
DeflectionSheme_VI | 5 |  triangle distributed loads - single span
DeflectionSheme_VII | 6 |  linear distributed loads, moments in the left and right - continues beam
DeflectionSheme_VIII | 7 |  one single force - cantilever
DeflectionSheme_IX | 8 |  triangle distributed loads - cantilever
DeflectionSheme_X | 9 |  one single force - non continues span
DeflectionSheme_XI | 10 |  trapezoidal shape of loads
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace